# Ghostty uses "PT Mono"; this machine already has it at:
# /System/Library/Fonts/Supplemental/PTMono.ttc
# The Homebrew cask currently fails with a 401 from its upstream URL.
# cask "font-pt-mono"

# Core terminal workflow.
brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "navi"

# Optional shell/productivity tools. Keep only the ones that earn their spot.
brew "zoxide"
brew "atuin"
brew "tealdeer"
brew "lazygit"
brew "gh"
brew "git-lfs"
brew "git"
brew "tmux"
brew "uv"
brew "yarn"

#view system
brew "fastfetch"
